In [2]:
import pandas as pd
import numpy as np

In [5]:
data = np.random.randn(4,3)
data

array([[-1.33319282,  0.1436843 , -0.09999304],
       [-0.70952984,  0.65085594,  0.26984508],
       [-0.20061201, -1.06763896, -0.43198209],
       [-0.54079166,  0.50137461,  0.81664478]])

In [7]:
data_frame = pd.DataFrame(data)
data

array([[-1.33319282,  0.1436843 , -0.09999304],
       [-0.70952984,  0.65085594,  0.26984508],
       [-0.20061201, -1.06763896, -0.43198209],
       [-0.54079166,  0.50137461,  0.81664478]])

In [10]:
new_df = pd.DataFrame(data, index = ["Görkem", "Kerem", "Kaan", "Emir"], columns = ["Salary", "Age", "Hour"])
new_df

          Salary       Age      Hour
Görkem -1.333193  0.143684 -0.099993
Kerem  -0.709530  0.650856  0.269845
Kaan   -0.200612 -1.067639 -0.431982
Emir   -0.540792  0.501375  0.816645

In [11]:
new_df.loc["Görkem"]

Salary   -1.333193
Age       0.143684
Hour     -0.099993
Name: Görkem, dtype: float64

In [13]:
new_df[["Age", "Salary"]]

             Age    Salary
Görkem  0.143684 -1.333193
Kerem   0.650856 -0.709530
Kaan   -1.067639 -0.200612
Emir    0.501375 -0.540792

In [14]:
new_df.iloc[0]

Salary   -1.333193
Age       0.143684
Hour     -0.099993
Name: Görkem, dtype: float64

In [15]:
new_df.iloc[1]

Salary   -0.709530
Age       0.650856
Hour      0.269845
Name: Kerem, dtype: float64

In [17]:
new_df.iloc[:,2]

Görkem   -0.099993
Kerem     0.269845
Kaan     -0.431982
Emir      0.816645
Name: Hour, dtype: float64

In [19]:
new_df["School"] = "Yeditepe"
new_df

          Salary       Age      Hour    School
Görkem -1.333193  0.143684 -0.099993  Yeditepe
Kerem  -0.709530  0.650856  0.269845  Yeditepe
Kaan   -0.200612 -1.067639 -0.431982  Yeditepe
Emir   -0.540792  0.501375  0.816645  Yeditepe

In [23]:
reset_frame = new_df.reset_index()
reset_frame

    index    Salary       Age      Hour    School
0  Görkem -1.333193  0.143684 -0.099993  Yeditepe
1   Kerem -0.709530  0.650856  0.269845  Yeditepe
2    Kaan -0.200612 -1.067639 -0.431982  Yeditepe
3    Emir -0.540792  0.501375  0.816645  Yeditepe

In [25]:
new_indices = ["Ati", "Kartal", "Gs", "Tr"]
new_df["NewIndex"] = new_indices

In [27]:
new_df.set_index("NewIndex", inplace=True)
new_df

            Salary       Age      Hour    School
NewIndex
Ati      -1.333193  0.143684 -0.099993  Yeditepe
Kartal   -0.709530  0.650856  0.269845  Yeditepe
Gs       -0.200612 -1.067639 -0.431982  Yeditepe
Tr       -0.540792  0.501375  0.816645  Yeditepe

In [30]:
new_df.drop(new_indices)

Empty DataFrame
Columns: [Salary, Age, Hour, School]
Index: []

In [42]:
first = ["Simpson", "Simpson", "Emma", "Gorkem", "Gorkem", "Gorkem"]
second = ["Homer", "Bart", "Watson", "Paradise", "Kenny", "Ayarlicazhocam"]
zipped_index = list(zip(first, second))

In [43]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Emma', 'Watson'),
 ('Gorkem', 'Paradise'),
 ('Gorkem', 'Kenny'),
 ('Gorkem', 'Ayarlicazhocam')]

In [44]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)
sample_values = np.ones((6,2))
big_df = pd.DataFrame(sample_values, index=zipped_index, columns= ["Age", "Salary"])

In [45]:
big_df

                        Age  Salary
Simpson Homer           1.0     1.0
        Bart            1.0     1.0
Emma    Watson          1.0     1.0
Gorkem  Paradise        1.0     1.0
        Kenny           1.0     1.0
        Ayarlicazhocam  1.0     1.0